Aesop_Services_Scripts/Create_Job_Test_Data.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0" jmeter="5.3">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="Test Plan" enabled="true">
      <boolProp name="TestPlan.functional_mode">false</boolProp>
      <boolProp name="TestPlan.tearDown_on_shutdown">true</boolProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments"/>
      </elementProp>
    </TestPlan>
    <hashTree>
      <CSVDataSet guiclass="TestBeanGUI" testclass="CSVDataSet" testname="CSV Data Set Config" enabled="true">
        <stringProp name="delimiter">,</stringProp>
        <stringProp name="filename">D:/apache-jmeter-5.3/apache-jmeter-5.3/bin/FINAL_test_DaTA/Org 139976_Final_Create_Job_11_Nov.csv</stringProp>
        <boolProp name="ignoreFirstLine">false</boolProp>
        <boolProp name="quotedData">false</boolProp>
        <boolProp name="recycle">true</boolProp>
        <stringProp name="shareMode">shareMode.all</stringProp>
        <boolProp name="stopThread">false</boolProp>
      </CSVDataSet>
      <hashTree/>
      <Arguments guiclass="ArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
        <collectionProp name="Arguments.arguments">
          <elementProp name="Random_Num" elementType="Argument">
            <stringProp name="Argument.name">Random_Num</stringProp>
            <stringProp name="Argument.value">${__Random(2,1000,Random_Num)}</stringProp>
            <stringProp name="Argument.metadata">=</stringProp>
          </elementProp>
        </collectionProp>
      </Arguments>
      <hashTree/>
      <ConfigTestElement guiclass="HttpDefaultsGui" testclass="ConfigTestElement" testname="HTTP Request Defaults" enabled="true">
        <elementProp name="HTTPsampler.Arguments" elementType="Arguments" guiclass="HTTPArgumentsPanel" testclass="Arguments" testname="User Defined Variables" enabled="true">
          <collectionProp name="Arguments.arguments"/>
        </elementProp>
        <stringProp name="HTTPSampler.domain">aesopapistage.flqa.net</stringProp>
        <stringProp name="HTTPSampler.protocol">https</stringProp>
        <stringProp name="HTTPSampler.concurrentPool">6</stringProp>
        <stringProp name="HTTPSampler.implementation">HttpClient4</stringProp>
      </ConfigTestElement>
      <hashTree/>
      <CacheManager guiclass="CacheManagerGui" testclass="CacheManager" testname="HTTP Cache Manager" enabled="true">
        <boolProp name="clearEachIteration">true</boolProp>
        <boolProp name="useExpires">false</boolProp>
        <boolProp name="CacheManager.controlledByThread">false</boolProp>
      </CacheManager>
      <hashTree/>
      <CookieManager guiclass="CookiePanel" testclass="CookieManager" testname="HTTP Cookie Manager" enabled="true">
        <collectionProp name="CookieManager.cookies"/>
        <boolProp name="CookieManager.clearEachIteration">true</boolProp>
        <boolProp name="CookieManager.controlledByThreadGroup">false</boolProp>
      </CookieManager>
      <hashTree/>
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Thread Group" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController" guiclass="LoopControlPanel" testclass="LoopController" testname="Loop Controller" enabled="true">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <stringProp name="LoopController.loops">22950</stringProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">10</stringProp>
        <stringProp name="ThreadGroup.ramp_time">10</stringProp>
        <boolProp name="ThreadGroup.scheduler">false</boolProp>
        <boolProp name="ThreadGroup.same_user_on_next_iteration">false</boolProp>
      </ThreadGroup>
      <hashTree>
        <CounterConfig guiclass="CounterConfigGui" testclass="CounterConfig" testname="Counter" enabled="false">
          <stringProp name="CounterConfig.start">1</stringProp>
          <stringProp name="CounterConfig.incr">1</stringProp>
          <stringProp name="CounterConfig.name">itr_no</stringProp>
          <boolProp name="CounterConfig.per_user">false</boolProp>
        </CounterConfig>
        <hashTree/>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create_Employee" enabled="false">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
  &quot;id&quot;: 0,&#xd;
  &quot;firstName&quot;: &quot;sachin_${Random_Num}&quot;,&#xd;
  &quot;middleName&quot;: null,&#xd;
  &quot;lastName&quot;: &quot;Agarwal_${Random_Num}&quot;,&#xd;
  &quot;identity&quot;: null,&#xd;
  &quot;phone&quot;: &quot;${__Random(1111111111,9999999999,Random_Num)}&quot;,&#xd;
  &quot;isVacancy&quot;: true,&#xd;
  &quot;isDeleted&quot;: true,&#xd;
  &quot;isVacancyPrivate&quot;: true,&#xd;
  &quot;title&quot;: null,&#xd;
  &quot;workerType&quot;: {&#xd;
    &quot;id&quot;: &quot;${Worker_id}&quot;,&#xd;
    &quot;title&quot;: &quot;Teacher&quot;,&#xd;
    &quot;DeductBreakFromAbsenceDuration&quot;: true,&#xd;
    &quot;BalanceTrackingType&quot;: 0&#xd;
  },&#xd;
  &quot;isActive&quot;: true,&#xd;
  &quot;loginId&quot;: null,&#xd;
  &quot;DeductBreakFromAbsenceDuration&quot;: true,&#xd;
  &quot;externalId&quot;: null,&#xd;
  &quot;absenceFeedback&quot;: {&#xd;
    &quot;id&quot;: 0,&#xd;
    &quot;numberOfRatings&quot;: 0,&#xd;
    &quot;totalScore&quot;: 0,&#xd;
    &quot;avgScore&quot;: 0&#xd;
  },&#xd;
  &quot;needSub&quot;: 0,&#xd;
  &quot;pin&quot;: &quot;${__Random(11111,99999,Random_Num)}&quot;,&#xd;
  &quot;identifier&quot;: &quot;${__RandomString(8,qwertyuiopasdfghjklzxcvbnm,Random_String)}&quot;,&#xd;
  &quot;isItinerant&quot;: true,&#xd;
  &quot;absenceFeedbackTotal&quot;: {&#xd;
    &quot;id&quot;: 0,&#xd;
    &quot;numberOfRatings&quot;: 0,&#xd;
    &quot;totalScore&quot;: 0,&#xd;
    &quot;avgScore&quot;: 0&#xd;
  },&#xd;
  &quot;accountingCode&quot;: {&#xd;
    &quot;id&quot;: 0,&#xd;
    &quot;orgId&quot;: &quot;${orgId}&quot;,&#xd;
    &quot;externalId&quot;: null,&#xd;
    &quot;name&quot;: null,&#xd;
    &quot;isPublic&quot;: true,&#xd;
    &quot;isAllocationGroup&quot;: true,&#xd;
    &quot;isFreeForm&quot;: true&#xd;
  },&#xd;
  &quot;budgetCode&quot;: {&#xd;
    &quot;id&quot;: 0,&#xd;
    &quot;description&quot;: null&#xd;
  },&#xd;
  &quot;institution&quot;: [&#xd;
    {&#xd;
      &quot;id&quot;: &quot;${institution_id}&quot;,&#xd;
      &quot;name&quot;: &quot;${Institution_name}&quot;,&#xd;
      &quot;parent&quot;: 0,&#xd;
      &quot;children&quot;: [&#xd;
        0&#xd;
      ],&#xd;
      &quot;isAvailable&quot;: true,&#xd;
      &quot;externalNumber&quot;: null,&#xd;
      &quot;address1&quot;: null,&#xd;
      &quot;address2&quot;: null,&#xd;
      &quot;address3&quot;: null,&#xd;
      &quot;address4&quot;: null,&#xd;
      &quot;city&quot;: null,&#xd;
      &quot;phone&quot;: null,&#xd;
      &quot;state&quot;: null,&#xd;
      &quot;zip&quot;: null,&#xd;
      &quot;fax&quot;: null,&#xd;
      &quot;active&quot;: true,&#xd;
      &quot;timeZone&quot;: 0,&#xd;
      &quot;timeZoneDescription&quot;: null,&#xd;
      &quot;startTime&quot;: null,&#xd;
      &quot;endTime&quot;: null,&#xd;
      &quot;halfDayAMEndTime&quot;: null,&#xd;
      &quot;halfDayPMStartTime&quot;: null,&#xd;
      &quot;subRelativeStartTimeMinutes&quot;: 0,&#xd;
      &quot;subRelativeEndTimeMins&quot;: 0,&#xd;
      &quot;subStartTime&quot;: null,&#xd;
      &quot;subEndTime&quot;: null,&#xd;
      &quot;subHalfDayAMEndTime&quot;: null,&#xd;
      &quot;subHalfDayPMStartTime&quot;: null,&#xd;
      &quot;requireCommentsWhenExcludingSubs&quot;: true,&#xd;
      &quot;HoursPerDay&quot;: 0,&#xd;
      &quot;MaxAbsenceDuration&quot;: 0,&#xd;
      &quot;MinAbsenceDuration&quot;: 0&#xd;
    }&#xd;
  ],&#xd;
  &quot;needFulfilment&quot;: 0,&#xd;
  &quot;EntitlementBalances&quot;: [&#xd;
    {&#xd;
      &quot;id&quot;: 0,&#xd;
      &quot;BalanceAsOf&quot;: null,&#xd;
      &quot;BaseBalance&quot;: 0,&#xd;
      &quot;CurrentBalance&quot;: 0,&#xd;
      &quot;EntitlementType&quot;: {&#xd;
        &quot;id&quot;: 0,&#xd;
        &quot;name&quot;: null,&#xd;
        &quot;description&quot;: null,&#xd;
        &quot;notesToAdminRequired&quot;: true,&#xd;
        &quot;isVacancyType&quot;: true,&#xd;
        &quot;isBucket&quot;: true,&#xd;
        &quot;parent&quot;: {},&#xd;
        &quot;needsApproval&quot;: true,&#xd;
        &quot;externalId&quot;: null,&#xd;
        &quot;externalId2&quot;: null,&#xd;
        &quot;institutionId&quot;: 0,&#xd;
        &quot;children&quot;: [&#xd;
          {}&#xd;
        ],&#xd;
        &quot;menuNumber&quot;: 0,&#xd;
        &quot;isPublic&quot;: true,&#xd;
        &quot;holdUntilApproved&quot;: true,&#xd;
        &quot;enforceEntitlementBalances&quot;: true,&#xd;
        &quot;workerTypes&quot;: [&#xd;
          {&#xd;
            &quot;id&quot;: 0,&#xd;
            &quot;title&quot;: null,&#xd;
            &quot;DeductBreakFromAbsenceDuration&quot;: true,&#xd;
            &quot;BalanceTrackingType&quot;: 0&#xd;
          }&#xd;
        ],&#xd;
        &quot;useMaxUsagePerYearMinutes&quot;: true,&#xd;
        &quot;maxUsagePerYearMinutes&quot;: 0,&#xd;
        &quot;useMinUsageMinutes&quot;: true,&#xd;
        &quot;minUsageMinutes&quot;: 0,&#xd;
        &quot;useMinBalanceMinutes&quot;: true,&#xd;
        &quot;minBalanceMinutes&quot;: 0,&#xd;
        &quot;dataAnalysisCategory&quot;: {&#xd;
          &quot;id&quot;: 0,&#xd;
          &quot;description&quot;: null&#xd;
        },&#xd;
        &quot;languageTexts&quot;: {},&#xd;
        &quot;lastUpdate&quot;: null&#xd;
      },&#xd;
      &quot;TenantId&quot;: 0,&#xd;
      &quot;WorkId&quot;: 0&#xd;
    }&#xd;
  ],&#xd;
  &quot;WorkHoursPerDay&quot;: 0&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/v1.0/Automation/Org/139966/SetupEmployee</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="Connection" elementType="Header">
                <stringProp name="Header.name">Connection</stringProp>
                <stringProp name="Header.value">keep-alive</stringProp>
              </elementProp>
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">AesopTokenLegacy</stringProp>
                <stringProp name="Header.value">6BD6C74C100E482597457C8DD1CD8CE5</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-538673239">success&quot;:true</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Regular Expression Extractor" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">Employee_id</stringProp>
            <stringProp name="RegexExtractor.regex">{&quot;data&quot;:(.+?),&quot;</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
          </RegexExtractor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleListener;
import org.apache.jmeter.samplers.SampleResult;
import org.apache.jmeter.testelement.OnErrorTestElement;
import org.apache.jmeter.protocol.http.sampler;

String Worker_id=&quot;${Employee_id}&quot;;
String institution_id=&quot;${institution_id}&quot;;
String Institution_name=&quot;${Institution_name}&quot;;

FileWriter fstream = new FileWriter(&quot;D:/apache-jmeter-5.3/apache-jmeter-5.3/bin/Result/workers_id.csv&quot;, true);
BufferedWriter out = new BufferedWriter(fstream);

/*if(${itr_no}==1)
{
	out.write(&quot;Worker_Id&quot;);
	out.write(System.getProperty(&quot;line.separator&quot;));
}*/

out.write(Worker_id + &quot;,&quot; + institution_id + &quot;,&quot; + Institution_name);
out.write(System.getProperty(&quot;line.separator&quot;));


out.close();
fstream.close();</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Login_To_Get_Token" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
&quot;loginId&quot;: &quot;report_139976&quot;,&#xd;
&quot;pin&quot;: &quot;1212&quot;,&#xd;
&quot;forceRefreshSession&quot;: true&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/v1.0/Login</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="Connection" elementType="Header">
                <stringProp name="Header.name">Connection</stringProp>
                <stringProp name="Header.value">keep-alive</stringProp>
              </elementProp>
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">Postman-Token</stringProp>
                <stringProp name="Header.value">3d9e10df-0699-4e30-b296-208b9d486bdb</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Regular Expression Extractor" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">access_token</stringProp>
            <stringProp name="RegexExtractor.regex">&quot;token&quot;:&quot;(.+?)&quot;},</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
          </RegexExtractor>
          <hashTree/>
          <ResponseAssertion guiclass="AssertionGui" testclass="ResponseAssertion" testname="Response Assertion" enabled="true">
            <collectionProp name="Asserion.test_strings">
              <stringProp name="-538673239">success&quot;:true</stringProp>
            </collectionProp>
            <stringProp name="Assertion.test_field">Assertion.response_data</stringProp>
            <boolProp name="Assertion.assume_success">false</boolProp>
            <intProp name="Assertion.test_type">16</intProp>
          </ResponseAssertion>
          <hashTree/>
        </hashTree>
        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Create_Jobs" enabled="true">
          <boolProp name="HTTPSampler.postBodyRaw">true</boolProp>
          <elementProp name="HTTPsampler.Arguments" elementType="Arguments">
            <collectionProp name="Arguments.arguments">
              <elementProp name="" elementType="HTTPArgument">
                <boolProp name="HTTPArgument.always_encode">false</boolProp>
                <stringProp name="Argument.value">{&#xd;
   &quot;feedBack&quot;:null,&#xd;
   &quot;id&quot;:0,&#xd;
   &quot;created&quot;:null,&#xd;
   &quot;requiresApproval&quot;:false,&#xd;
   &quot;isApproved&quot;:false,&#xd;
   &quot;isDenied&quot;:false,&#xd;
   &quot;isPartiallyApproved&quot;:false,&#xd;
   &quot;needSub&quot;:true,&#xd;
   &quot;isHeld&quot;:false,&#xd;
   &quot;pastEmployeeCancelCutoff&quot;:false,&#xd;
   &quot;heldPastFulfillmentCutoff&quot;:false,&#xd;
   &quot;startDate&quot;:null,&#xd;
   &quot;endDate&quot;:null,&#xd;
   &quot;heldUntil&quot;:null,&#xd;
   &quot;worker&quot;:{&#xd;
      &quot;id&quot;:&quot;${Worker_id}&quot;,&#xd;
      &quot;firstName&quot;:null,&#xd;
      &quot;middleName&quot;:null,&#xd;
      &quot;lastName&quot;:null,&#xd;
      &quot;identity&quot;:null,&#xd;
      &quot;phone&quot;:null,&#xd;
      &quot;isVacancy&quot;:false,&#xd;
      &quot;isDeleted&quot;:false,&#xd;
      &quot;isVacancyPrivate&quot;:false,&#xd;
      &quot;title&quot;:null,&#xd;
      &quot;workerType&quot;:null,&#xd;
      &quot;isActive&quot;:false,&#xd;
      &quot;loginId&quot;:null,&#xd;
      &quot;DeductBreakFromAbsenceDuration&quot;:null,&#xd;
      &quot;externalId&quot;:null,&#xd;
      &quot;absenceFeedback&quot;:null,&#xd;
      &quot;needSub&quot;:0,&#xd;
      &quot;pin&quot;:null,&#xd;
      &quot;identifier&quot;:null,&#xd;
      &quot;isItinerant&quot;:false,&#xd;
      &quot;absenceFeedbackTotal&quot;:null,&#xd;
      &quot;accountingCode&quot;:null,&#xd;
      &quot;budgetCode&quot;:null,&#xd;
      &quot;institution&quot;:null,&#xd;
      &quot;needFulfilment&quot;:0,&#xd;
      &quot;EntitlementBalances&quot;:null,&#xd;
      &quot;WorkHoursPerDay&quot;:null&#xd;
   },&#xd;
   &quot;substitute&quot;:null,&#xd;
   &quot;absences&quot;:[&#xd;
      {&#xd;
         &quot;id&quot;:0,&#xd;
         &quot;absrId&quot;:0,&#xd;
         &quot;date&quot;:&quot;${Date}&quot;,&#xd;
         &quot;lastUpdated&quot;:&quot;&quot;,&#xd;
         &quot;institution&quot;:{&#xd;
            &quot;id&quot;:&quot;${institution_id}&quot;,&#xd;
            &quot;name&quot;:null,&#xd;
            &quot;parent&quot;:null,&#xd;
            &quot;children&quot;:null,&#xd;
            &quot;isAvailable&quot;:null,&#xd;
            &quot;externalNumber&quot;:null,&#xd;
            &quot;address1&quot;:null,&#xd;
            &quot;address2&quot;:null,&#xd;
            &quot;address3&quot;:null,&#xd;
            &quot;address4&quot;:null,&#xd;
            &quot;city&quot;:null,&#xd;
            &quot;phone&quot;:null,&#xd;
            &quot;state&quot;:null,&#xd;
            &quot;zip&quot;:null,&#xd;
            &quot;fax&quot;:null,&#xd;
            &quot;active&quot;:false,&#xd;
            &quot;timeZone&quot;:0,&#xd;
            &quot;timeZoneDescription&quot;:null,&#xd;
            &quot;startTime&quot;:null,&#xd;
            &quot;endTime&quot;:null,&#xd;
            &quot;halfDayAMEndTime&quot;:null,&#xd;
            &quot;halfDayPMStartTime&quot;:null,&#xd;
            &quot;subRelativeStartTimeMinutes&quot;:0,&#xd;
            &quot;subRelativeEndTimeMins&quot;:0,&#xd;
            &quot;subStartTime&quot;:null,&#xd;
            &quot;subEndTime&quot;:null,&#xd;
            &quot;subHalfDayAMEndTime&quot;:null,&#xd;
            &quot;subHalfDayPMStartTime&quot;:null,&#xd;
            &quot;requireCommentsWhenExcludingSubs&quot;:null,&#xd;
            &quot;HoursPerDay&quot;:0,&#xd;
            &quot;MaxAbsenceDuration&quot;:0,&#xd;
            &quot;MinAbsenceDuration&quot;:0&#xd;
         },&#xd;
         &quot;entitlement&quot;:{&#xd;
            &quot;id&quot;:&quot;${entitlement_Reason}&quot;,&#xd;
            &quot;name&quot;:null,&#xd;
            &quot;notesToAdminRequired&quot;:null,&#xd;
            &quot;description&quot;:null,&#xd;
            &quot;isVacancyType&quot;:false,&#xd;
            &quot;isBucket&quot;:false,&#xd;
            &quot;parent&quot;:null,&#xd;
            &quot;needsApproval&quot;:null,&#xd;
            &quot;externalId&quot;:null,&#xd;
            &quot;externalId2&quot;:null,&#xd;
            &quot;institutionId&quot;:null,&#xd;
            &quot;children&quot;:null,&#xd;
            &quot;menuNumber&quot;:null,&#xd;
            &quot;isPublic&quot;:null,&#xd;
            &quot;holdUntilApproved&quot;:null,&#xd;
            &quot;enforceEntitlementBalances&quot;:false,&#xd;
            &quot;workerTypes&quot;:null,&#xd;
            &quot;useMaxUsagePerYearMinutes&quot;:false,&#xd;
            &quot;maxUsagePerYearMinutes&quot;:null,&#xd;
            &quot;useMinUsageMinutes&quot;:false,&#xd;
            &quot;minUsageMinutes&quot;:null,&#xd;
            &quot;useMinBalanceMinutes&quot;:false,&#xd;
            &quot;minBalanceMinutes&quot;:null,&#xd;
            &quot;dataAnalysisCategory&quot;:null,&#xd;
            &quot;languageTexts&quot;:null,&#xd;
            &quot;lastUpdate&quot;:null&#xd;
         },&#xd;
         &quot;shiftType&quot;:1,&#xd;
         &quot;accountingCode&quot;:null,&#xd;
         &quot;payCode&quot;:null,&#xd;
         &quot;budgetCode&quot;:null,&#xd;
         &quot;absenceStartTime&quot;:&quot;09:00 AM&quot;,&#xd;
         &quot;absenceEndTime&quot;:&quot;03:00 PM&quot;,&#xd;
         &quot;substituteStartTime&quot;:&quot;09:00 AM&quot;,&#xd;
         &quot;substituteEndTime&quot;:&quot;05:00 PM&quot;,&#xd;
         &quot;substituteShiftType&quot;:1,&#xd;
         &quot;canReconciled&quot;:false,&#xd;
         &quot;isReconciled&quot;:false,&#xd;
         &quot;nonPayTime&quot;:&quot;00:00&quot;,&#xd;
         &quot;userSpecifiedAbsenceDuration&quot;:&quot;08:00&quot;,&#xd;
         &quot;hoursSubWorked&quot;:null,&#xd;
         &quot;timesAreLinked&quot;:true,&#xd;
         &quot;adjustedDurationAmount&quot;:0,&#xd;
         &quot;isEditable&quot;:false,&#xd;
         &quot;closedDay&quot;:null,&#xd;
         &quot;vacancyDuration&quot;:null,&#xd;
         &quot;vacancyBreakDuration&quot;:null,&#xd;
         &quot;absenceDuration&quot;:null,&#xd;
         &quot;absenceBreakDuration&quot;:null,&#xd;
         &quot;ShowVacancyTimes&quot;:false,&#xd;
         &quot;worker&quot;:null,&#xd;
         &quot;substitute&quot;:null,&#xd;
         &quot;readOnlyReason&quot;:null,&#xd;
         &quot;DeductBreakFromAbsenceDuration&quot;:false,&#xd;
         &quot;IsHeld&quot;:false,&#xd;
         &quot;NeedSub&quot;:false,&#xd;
         &quot;IsVacancy&quot;:false,&#xd;
         &quot;percentOfDay&quot;:0,&#xd;
         &quot;percentOfDayRounded&quot;:0,&#xd;
         &quot;balanceTrackingType&quot;:0,&#xd;
         &quot;ReconcileDate&quot;:null,&#xd;
         &quot;UpdateReconcileState&quot;:null,&#xd;
         &quot;isDeletable&quot;:false,&#xd;
         &quot;noDeleteReason&quot;:null,&#xd;
         &quot;extension&quot;:0&#xd;
      }&#xd;
   ],&#xd;
   &quot;closedDayAbsences&quot;:null,&#xd;
   &quot;deletedAbsences&quot;:null,&#xd;
   &quot;isCancelled&quot;:false,&#xd;
   &quot;isClosed&quot;:false,&#xd;
   &quot;notes&quot;:&quot;&quot;,&#xd;
   &quot;notesToAdmin&quot;:&quot;&quot;,&#xd;
   &quot;notesToAdminOnly&quot;:&quot;&quot;,&#xd;
   &quot;lastUpdated&quot;:&quot;2020-06-11T07:54:11.019Z&quot;,&#xd;
   &quot;dbLastUpdatedTimeStamp&quot;:&quot;2020-06-11T07:54:11.019Z&quot;,&#xd;
   &quot;holdOption&quot;:&quot;DoNotHoldAbsenceRequest&quot;,&#xd;
   &quot;balanceTrackingType&quot;:0,&#xd;
   &quot;numApproved&quot;:0,&#xd;
   &quot;lastApprovedAction&quot;:null,&#xd;
   &quot;approverName&quot;:null,&#xd;
   &quot;approverKey&quot;:null,&#xd;
   &quot;canApprove&quot;:false,&#xd;
   &quot;canDeny&quot;:false,&#xd;
   &quot;canDenyPart&quot;:false,&#xd;
   &quot;isDeleted&quot;:false,&#xd;
   &quot;hoursPerDay&quot;:0,&#xd;
   &quot;approverComments&quot;:null,&#xd;
   &quot;grossPayAmount&quot;:0,&#xd;
   &quot;isLocked&quot;:false,&#xd;
   &quot;context&quot;:null,&#xd;
   &quot;maxApproverLevel&quot;:0,&#xd;
   &quot;fileCount&quot;:0,&#xd;
   &quot;cancelReason&quot;:null&#xd;
}</stringProp>
                <stringProp name="Argument.metadata">=</stringProp>
              </elementProp>
            </collectionProp>
          </elementProp>
          <stringProp name="HTTPSampler.path">api/v1.0/AbsenceRequests</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.auto_redirects">false</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
          <boolProp name="HTTPSampler.DO_MULTIPART_POST">false</boolProp>
        </HTTPSamplerProxy>
        <hashTree>
          <HeaderManager guiclass="HeaderPanel" testclass="HeaderManager" testname="HTTP Header Manager" enabled="true">
            <collectionProp name="HeaderManager.headers">
              <elementProp name="Content-Type" elementType="Header">
                <stringProp name="Header.name">Content-Type</stringProp>
                <stringProp name="Header.value">application/json</stringProp>
              </elementProp>
              <elementProp name="Connection" elementType="Header">
                <stringProp name="Header.name">Connection</stringProp>
                <stringProp name="Header.value">keep-alive</stringProp>
              </elementProp>
              <elementProp name="Authorization" elementType="Header">
                <stringProp name="Header.name">AesopToken</stringProp>
                <stringProp name="Header.value">${access_token}</stringProp>
              </elementProp>
            </collectionProp>
          </HeaderManager>
          <hashTree/>
          <RegexExtractor guiclass="RegexExtractorGui" testclass="RegexExtractor" testname="Regular Expression Extractor" enabled="true">
            <stringProp name="RegexExtractor.useHeaders">false</stringProp>
            <stringProp name="RegexExtractor.refname">Job_COnfirmation_ID</stringProp>
            <stringProp name="RegexExtractor.regex">&quot;absrId&quot;:(.+?),&quot;</stringProp>
            <stringProp name="RegexExtractor.template">$1$</stringProp>
          </RegexExtractor>
          <hashTree/>
          <BeanShellPostProcessor guiclass="TestBeanGUI" testclass="BeanShellPostProcessor" testname="BeanShell PostProcessor_Final" enabled="true">
            <boolProp name="resetInterpreter">false</boolProp>
            <stringProp name="script">import org.apache.jmeter.samplers.SampleListener;
import org.apache.jmeter.samplers.SampleResult;
import org.apache.jmeter.testelement.OnErrorTestElement;
import org.apache.jmeter.protocol.http.sampler;

String ID=&quot;${Job_COnfirmation_ID}&quot;;
String Substitute_User=&quot;${Substitute_user_id}&quot;;
String orgId=&quot;${orgId}&quot;;
String Employee_Id=&quot;${Worker_id}&quot;;
String Sub_Id=&quot;${Substitute_id}&quot;;

FileWriter fstream = new FileWriter(&quot;D:/apache-jmeter-5.3/apache-jmeter-5.3/bin/Result/Job_Confirmation_number_139976_5.csv&quot;, true);
BufferedWriter out = new BufferedWriter(fstream);

/*if(${itr_no}==1)
{
	out.write(&quot;Worker_Id&quot;);
	out.write(System.getProperty(&quot;line.separator&quot;));
}*/

out.write(ID + &quot;,&quot; + Substitute_User + &quot;,&quot; + orgId + &quot;,&quot; + Employee_Id + &quot;,&quot; + Sub_Id);
out.write(System.getProperty(&quot;line.separator&quot;));


out.close();
fstream.close();</stringProp>
          </BeanShellPostProcessor>
          <hashTree/>
        </hashTree>
        <ConstantTimer guiclass="ConstantTimerGui" testclass="ConstantTimer" testname="Constant Timer" enabled="true">
          <stringProp name="ConstantTimer.delay">300</stringProp>
        </ConstantTimer>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report_Success" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <boolProp name="ResultCollector.success_only_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="StatVisualizer" testclass="ResultCollector" testname="Aggregate Report_Error" enabled="true">
          <boolProp name="ResultCollector.error_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
        <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="false">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <boolProp name="ResultCollector.success_only_logging">true</boolProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>
      <ResultCollector guiclass="ViewResultsFullVisualizer" testclass="ResultCollector" testname="View Results Tree" enabled="true">
        <boolProp name="ResultCollector.error_logging">true</boolProp>
      </ResultCollector>
      <hashTree/>
    </hashTree>
  </hashTree>
</jmeterTestPlan>